       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. Piombacciaio.

       PROCEDURE DIVISION.
           DISPLAY "HELLO, WORLD!".
           STOP RUN.
